var projectsJSON = '[{ "name":"Mushroom Madness Game","screenshot":"img/MushroomMadness1.png","description":"An arcade game made with the Unity game engine for Windows utilising touch and accelerometer controls. The user must identify and collect a specified type of mushroom with a time limit while avoiding other varieties. Features include a custom Cg shader that utilises cel shading, high scores saved to the local device, multiple levels with increasing difficulty and randomised generation of mushrooms for replayability.","role":"Individual Project - Design, Implementation and Testing","tools":["Unity Game Engine", "Sourcetree", "Microsoft Visual Studio"],"languages":["C#", "Cg Shader"],"github":"https://github.com/stewartcollins7/mushroommadness"},{ "name":"Average Negative Web Application","screenshot":"img/AverageNegative4.png","description":"A web application that allows users to create virtual art galleries in 3D spaces by uploading images. Gallery images generated with uploaded images inserted into an empty gallery with rooms traversable through google street plugin. Features include the ability to edit uploaded galleries, secure user login, video multimedia support in galleries and user comments","role":"Back End Developer - Design and Construction of SQL Database, Development of Object Classes and Database Retrival on Server, Secure Login, Collaboration in Overall Project Design and Documentation","tools":["SQL Server", "Xamarin", "Azure", "Sourcetree"],"languages":["C#", "ASP.Net", "SQL"],"github":"https://github.com/stewartcollins7/average-negative-project-database-component"},{ "name":"Stewart Collins .net","screenshot":"img/MySite.png","description":"A front end site I made as a portfolio. Uses bootstrap for formatting and generates the main project page from JSON to simulate receiving information from a server. Optimised for mobile, tablet and desktop browsers.","role":"Individual Project","tools":["Amazon Web Services", "Bootstrap","Eclipse"],"languages":["HTML", "CSS", "Javascript"],"github":"https://github.com/stewartcollins7/stewartcollins.net"},{ "name":"Cactus Jumper Game","screenshot":"img/RTTMC1.png","description":"A platforming game made using the Unity Game Engine for Android devices. As the final year significant project strong emphaisis was placed on requirements analysis, design and documentation to facilitate development between team members. Tasks were planned and tracked using Trello, deadlines for prototypes were met at different stages of the process and automated testing was required. Features include high scores, multiple levels and game modes, saved replays, multiplayer connectivity between players and utilization of android touch controls.","role":"Project Leader, Game Component Developer","tools":["Unity Game Engine", "Visual Studio", "Trello", "Slack", "Sourcetree"],"languages":["C#"],"github":"https://github.com/stewartcollins7/cactus-jumper"},{ "name":"Self Driving Car Simulation - Planning Module","screenshot":null,"description":"A route planning and driving module for a self driving car simulation. The project needed to conform to specified interface guidelines to allow integration with modules from other groups handling object sensing and identification. The module takes a destination location in the simulation and constructs an efficient route to the target by constructing a graph based on supplied road information. The module then predicts an estimated time to destination and drives the car on the simulation map reacting to external collision objects and traffic lights.","role":"Project Leader - Overall Design and Implementation of Route Planning and Car Controller Components","tools":["Eclipse"],"languages":["Java"],"github":"https://github.com/stewartcollins7/self-driving-car-module-project"},{ "name":"Mastermind Client Server Application","screenshot":null,"description":"A low level client server application in C. The server component generates a secret code and listens on an open socket to establish a TCP connection using system calls. The client component operates through a bash shell that submits guesses to the server to try and guess the secret code. Server can handle concurrent connections from multiple clients using a mutex.","role":"Individual Project","tools":["GDB", "jEdit", "minGW"],"languages":["C"],"github":"https://github.com/stewartcollins7/client-server-mastermind-c"},{"name":"Haskell Finite Automata Manipulation","screenshot":null,"description":"Part of a university project using the declarative language Haskell to manipulate Discrete Finite Automata. Calculates things such as the compliment of a DFA, trimming or completing a DFA and calculating the product of two DFAs.","role":"Individual Project","tools":["jEdit", "WinGHCi"],"languages":["Haskell"],"github":"https://github.com/stewartcollins7/haskell-dfa-project"}]';